CSI API ETABS v1
cSapModel.ConstraintDef Property
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
cConstraint ConstraintDef { get; }
ReadOnly Property ConstraintDef As cConstraint
	Get
Dim instance As cSapModel
Dim value As cConstraint
value = instance.ConstraintDef
property cConstraint^ ConstraintDef {
	cConstraint^ get ();
}
abstract ConstraintDef : cConstraint with get
Property Value
Type: cConstraint
See Also
Reference
cSapModel Interface
ETABSv1 Namespace